# PropertiesPalette Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePanes..::..BuiltInDockablePanes..::..PropertiesPalette Property
DockablePanes..::..BuiltInDockablePanes Class See Also
---
The properties palette pane.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static DockablePaneId PropertiesPalette { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PropertiesPalette As DockablePaneId
	Get
```

Visual C++
---
```text
public:
static property DockablePaneId^ PropertiesPalette {
	DockablePaneId^ get ();
}
```

# See Also
DockablePanes..::..BuiltInDockablePanes Class
Autodesk.Revit.UI Namespace